## Data preparation and export

### 1. Import libraries

In [1]:

import pandas as pd
import mysql.connector
from sqlalchemy import create_engine

### 2. Data import and preparation

#### 2.1 artists

In [52]:
# Read your CSV file into a Pandas dataframe
df_artist= pd.read_csv("artist.csv")
df_artist.head()#Initial check to verify the columns and data

,artist_id,full_name,first_name,middle_names,last_name,nationality,style,birth,death
0,500,Pierre-Auguste Renoir,Pierre,Auguste,Renoir,French,Impressionist,1841,1919
1,501,Alexandre Cabanel,Alexandre,NaN,Cabanel,French,Classicist,1823,1889
2,502,James Ensor,James,NaN,Ensor,Belgian,Expressionist,1860,1949
3,503,Maximilien Luce,Maximilien,NaN,Luce,French,Pointillist,1858,1941
4,504,August Macke,August,NaN,Macke,German,Expressionist,1887,1914

In [53]:
print("This df has " + str(df_artist.shape[0])+" rows and "+str(df_artist.shape[1])+" colums." )
print("v---------Null Values---------v")
print(df_artist.isnull().sum())#Check any null values , in this case null values are only on middle names which is a column we can drop

This df has 421 rows and 9 colums.
v---------Null Values---------v
artist_id         0
full_name         0
first_name        0
middle_names    273
last_name         0
nationality       0
style             0
birth             0
death             0
dtype: int64

In [54]:
df_artist.drop("middle_names", axis=1, inplace=True)#Drop the unnecessary column

In [55]:
df_artist.dtypes # Verify the data type of each column.Eventhough birth and death columns refer to dates only have the year therefore 
#we keep the int dtype for now

artist_id       int64
full_name      object
first_name     object
last_name      object
nationality    object
style          object
birth           int64
death           int64
dtype: object

#### 2.2 canvas_size

In [58]:
# Read your CSV file into a Pandas dataframe
df_canvas_size= pd.read_csv("canvas_size.csv")
df_canvas_size.head()#Initial check to verify the columns and data

   size_id  width  height          label
0       20     20     NaN  20" Long Edge
1       24     24     NaN  24" Long Edge
2       30     30     NaN  30" Long Edge
3       36     36     NaN  36" Long Edge
4       40     40     NaN  40" Long Edge

In [62]:
print("This df has " + str(df_canvas_size.shape[0])+" rows and "+str(df_canvas_size.shape[1])+" colums." )
print("v---------Null Values---------v")
print(df_canvas_size.isnull().sum())#Check any null values , all paintings should have a height value we will drop the null values

This df has 193 rows and 4 colums.
v---------Null Values---------v
size_id    0
width      0
height     0
label      0
dtype: int64

In [60]:
df_canvas_size.dropna(inplace=True)

In [61]:
df_canvas_size.dtypes

size_id      int64
width        int64
height     float64
label       object
dtype: object

#### 2.3 image_link

In [29]:
# Read your CSV file into a Pandas dataframe
df_image_link= pd.read_csv("image_link.csv")
df_image_link.head()#Initial check to verify the columns and data

,work_id,url,thumbnail_small_url,thumbnail_large_url
0,181978,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
1,173188,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
2,194065,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
3,129337,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...
4,141073,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...,https://v5.airtableusercontent.com/v1/15/15/16...

In [64]:
print("This df has " + str(df_image_link.shape[0])+" rows and "+str(df_image_link.shape[1])+" colums." )
print("v---------Null Values---------v")
print(df_image_link.isnull().sum())#Check any null values ,

This df has 14773 rows and 4 colums.
v---------Null Values---------v
work_id                0
url                    0
thumbnail_small_url    0
thumbnail_large_url    0
dtype: int64

In [63]:
df_image_link.dropna(inplace=True)
df_image_link.dtypes

work_id                 int64
url                    object
thumbnail_small_url    object
thumbnail_large_url    object
dtype: object

#### 2.4 museum_hours

In [88]:
# Read your CSV file into a Pandas dataframe
df_museum_hours= pd.read_csv("museum_hours.csv")
df_museum_hours.head()#Initial check to verify the columns and data 
#openning and closing hours include the "AM" and "PM" in their values , we will remove those and convert it to 24HR

   museum_id        day      open     close
0         30     Sunday  10:30:AM  05:30:PM
1         30     Monday  10:30:AM  05:30:PM
2         30    Tuesday  10:30:AM  05:30:PM
3         30  Wednesday  10:30:AM  05:30:PM
4         30    Thusday  10:30:AM  05:30:PM

In [89]:
# Extract the last 3 characters to a new column
df_museum_hours['openTime'] = df_museum_hours['open'].str[-2:]
df_museum_hours['open'] = df_museum_hours['open'].str[:-3]
############################################################
df_museum_hours['CloseTime'] = df_museum_hours['close'].str[-2:]
df_museum_hours['close'] = df_museum_hours['close'].str[:-3]
df_museum_hours.head()
############################################################

   museum_id        day   open  close openTime CloseTime
0         30     Sunday  10:30  05:30       AM        PM
1         30     Monday  10:30  05:30       AM        PM
2         30    Tuesday  10:30  05:30       AM        PM
3         30  Wednesday  10:30  05:30       AM        PM
4         30    Thusday  10:30  05:30       AM        PM

In [90]:
# Function to convert to 24-hour time
def convert_to_24_hour(time, period):
    if period == 'PM' and time[:2] != '12':
        hour, minute = map(int, time.split(':'))
        hour += 12  # Add 12 to convert to 24-hour format
    elif period == 'AM' and time[:2] == '12':
        hour, minute = 0, int(time.split(':')[1])  # Handle midnight (12:00 AM)
    else:
        hour, minute = map(int, time.split(':'))  # No conversion needed for other cases

    return f'{hour:02}:{minute:02}'  # Ensure 2-digit formatting

# Apply the conversion function to 'open' and 'close' columns
df_museum_hours['open_24hr'] = df_museum_hours.apply(
    lambda x: convert_to_24_hour(x['open'], x['openTime']), axis=1
)
df_museum_hours['close_24hr'] = df_museum_hours.apply(
    lambda x: convert_to_24_hour(x['close'], x['CloseTime']), axis=1
)

# Display the modified DataFrame
df_museum_hours.head()

   museum_id        day   open  close openTime CloseTime open_24hr close_24hr
0         30     Sunday  10:30  05:30       AM        PM     10:30      17:30
1         30     Monday  10:30  05:30       AM        PM     10:30      17:30
2         30    Tuesday  10:30  05:30       AM        PM     10:30      17:30
3         30  Wednesday  10:30  05:30       AM        PM     10:30      17:30
4         30    Thusday  10:30  05:30       AM        PM     10:30      17:30

In [91]:
df_museum_hours.drop(['open', 'close', 'openTime', 'CloseTime'], axis=1, inplace=True)#Drop the unnecessary columns
df_museum_hours.rename(columns={'open_24hr': 'open','close_24hr':'close'}, inplace=True)
df_museum_hours.head()

   museum_id        day   open  close
0         30     Sunday  10:30  17:30
1         30     Monday  10:30  17:30
2         30    Tuesday  10:30  17:30
3         30  Wednesday  10:30  17:30
4         30    Thusday  10:30  17:30

In [92]:

print("This df has " + str(df_museum_hours.shape[0])+" rows and "+str(df_museum_hours.shape[1])+" colums." )
print("v---------Null Values---------v")
print(df_museum_hours.isnull().sum())#Check any null values , in this case null values are only on middle names which is a column we can drop

This df has 351 rows and 4 colums.
v---------Null Values---------v
museum_id    0
day          0
open         0
close        0
dtype: int64

In [93]:
df_museum_hours.dtypes

museum_id     int64
day          object
open         object
close        object
dtype: object

#### 2.5 museum

In [36]:
# Read your CSV file into a Pandas dataframe
df_museum= pd.read_csv("museum.csv")
df_museum.head()#Initial check to verify the columns and data

,museum_id,name,address,city,state,postal,country,phone,url
0,30,The Museum of Modern Art,11 W 53rd St,New York,NY,10019,USA,+1 212 708-9400,https://www.moma.org/
1,31,Pushkin State Museum of Fine Arts,12 Ulitsa Volkhonka,Moscow,NaN,119019,Russia,+7 495 697-95-78,https://pushkinmuseum.art/
2,32,National Gallery of Victoria,180 St Kilda Rd,Melbourne,Victoria,3004,Australia,+61 (0)3 8620 2222,https://www.ngv.vic.gov.au/
3,33,S達o Paulo Museum of Art,"Av. Paulista, 1578 - Bela Vista",S達o Paulo,NaN,01310-200,Brazil,+55 11 3149-5959,https://masp.org.br/
4,34,The State Hermitage Museum,Palace Square,2,Sankt-Peterburg,190000,Russia,7 812 710-90-79,https://www.hermitagemuseum.org/wps/portal/her...

In [37]:


print("This df has " + str(df_museum.shape[0])+" rows and "+str(df_museum.shape[1])+" colums." )
print("v---------Null Values---------v")
print(df_museum.isnull().sum())#Check any null values , in this case null values are only on middle names which is a column we can drop

This df has 57 rows and 9 colums.
v---------Null Values---------v
museum_id     0
name          0
address       0
city          0
state        19
postal        7
country       0
phone         0
url           0
dtype: int64

In [38]:
df_museum.dtypes

museum_id     int64
name         object
address      object
city         object
state        object
postal       object
country      object
phone        object
url          object
dtype: object

#### 2.6 product_size

In [39]:
# Read your CSV file into a Pandas dataframe
df_product_size= pd.read_csv("product_size.csv")
df_product_size.head()#Initial check to verify the columns and data

   work_id size_id  sale_price  regular_price
0   160228      24          85             85
1   160228      30          95             95
2   160236      24          85             85
3   160236      30          95             95
4   160244      24          85             85

In [40]:
print("This df has " + str(df_product_size.shape[0])+" rows and "+str(df_product_size.shape[1])+" colums." )
print("v---------Null Values---------v")
print(df_product_size.isnull().sum())#Check any null values , in this case null values are only on middle names which is a column we can drop

This df has 110347 rows and 4 colums.
v---------Null Values---------v
work_id          0
size_id          0
sale_price       0
regular_price    0
dtype: int64

In [41]:
df_product_size.dtypes

work_id           int64
size_id          object
sale_price        int64
regular_price     int64
dtype: object

#### 2.7 subject

In [42]:
# Read your CSV file into a Pandas dataframe
df_subject= pd.read_csv("subject.csv")
df_subject.head()#Initial check to verify the columns and data

   work_id     subject
0   160228  Still-Life
1   160236  Still-Life
2   160244  Still-Life
3   160252  Still-Life
4   160260  Still-Life

In [43]:
print("This df has " + str(df_subject.shape[0])+" rows and "+str(df_subject.shape[1])+" colums." )
print("v---------Null Values---------v")
print(df_subject.isnull().sum())#Check any null values , in this case null values are only on middle names which is a column we can drop

This df has 6771 rows and 2 colums.
v---------Null Values---------v
work_id    0
subject    0
dtype: int64

In [45]:
df_subject.dtypes

work_id     int64
subject    object
dtype: object

#### 2.8 work

In [46]:
# Read your CSV file into a Pandas dataframe
df_work= pd.read_csv("work.csv")
df_work.head()#Initial check to verify the columns and data

,work_id,name,artist_id,style,museum_id
0,160228,Still Life with Flowers and a Watch,615,Baroque,43.0
1,160236,Still Life with Fruit and a Beaker on a Cock's...,615,Baroque,43.0
2,160244,Still Life with Fruit and a Goldfinch,615,Baroque,43.0
3,160252,Still Life with Fruit and Oysters,615,Baroque,43.0
4,160260,"Still Life with Fruit, Oysters, and a Porcelai...",615,Baroque,43.0

In [47]:

print("This df has " + str(df_work.shape[0])+" rows and "+str(df_work.shape[1])+" colums." )
print("v---------Null Values---------v")
print(df_work.isnull().sum())#Check any null values , in this case null values are only on middle names which is a column we can drop

This df has 14776 rows and 5 colums.
v---------Null Values---------v
work_id          0
name             0
artist_id        0
style         1286
museum_id    10223
dtype: int64

In [48]:
df_work.dtypes

work_id        int64
name          object
artist_id      int64
style         object
museum_id    float64
dtype: object

In [ ]:
files = ['artist', 'canvas_size', 'image_link', 'museum_hours', 'museum', 'product_size', 'subject', 'work']

for file in files:
    df = pd.read_csv(f'/Users/thoufiq/THOUFIQ/techTFQ/YouTube/VIDEOS/SQL Queries/SQL Case Studies - Datasets/Famous Paintings/Dataset/{file}.csv')
    df.to_sql(file, con=conn, if_exists='replace', index=False)

### 3. MySql Connection

In [2]:
#Input the host name ,user and password of the server
mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="Vivoenalemania2024"
)

print(mydb) #Verify the connection

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001E50B19BE60>

In [3]:
mycursor=mydb.cursor()
mycursor.execute("CREATE DATABASE IF NOT EXISTS sql_paintings") # Create a Database  if not exists already 
print("Database created or already exists.") # Confirmation message

Database created or already exists.

In [4]:
mycursor.execute("SHOW DATABASES") # Verify the existing databases, our previously created DB should be listed here
for db in mycursor:
    print(db)

('employees',)
('employees_mod',)
('information_schema',)
('mysql',)
('parks_and_recreation',)
('performance_schema',)
('sakila',)
('sql_paintings',)
('sys',)
('world',)

In [ ]:
# Store the dataframe in MySQL
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:Vivoenalemania2024@localhost/sql_painting')
with engine.begin() as connection:
    df.to_sql('your_table', con=connection, if_exists='replace', index=False)